questions That I need to answer in order to answer the main question what is the steps to lower the reurn and rejected orders 
1- get the successfully delivered rate shippemnt per company 
2-  what is the co relation between these faild orders 
3- is there a corelation between the location and the returned items 
4- cash vs credit  % and the refund and return between both cash and credit payments 
5- is there a certian day that has more rejected or exchange orders

In [40]:
#First, I load the data and import the libraries that I may use import pandas as PD 
import numpy as np 
%matplotlib inline
import matplotlib.pyplot as plt
import pandas as pd

df=pd.read_csv(r'C:\Users\FADIA\Downloads\Sigma Fit  - Sheet1.csv')
df.head()

,Order No,Type,Cash or Visa,Total,Lineitem sku,Billing Name,Billing Street,Billing City,BillingPhone,Notes,Shipping Company,Date,Money collocation,Shipping Updates,Reason,Governorate
0,#26666,New,Cash,1071,(1)MNP13+(1)MBL13+(1)MBL23,Donia Soliman,"Sheraton Heliopolis, 6 Mahmoud essmat hamdy, 6...",Heliopolis-Masaken Sheraton,2.01E+11,NaN,kindex,2/1/2022,DONE,Delivered,NaN,Cairo
1,#26670,New,Cash,720,(1)MCS23,Mahmoud Hefnawy,"8شارع ترعة السواحل طناش الوراق, Elwaraaq",Warraq,2.01E+11,NaN,kindex,2/1/2022,DONE,Delivered,NaN,Warraq
2,#26674,New,Cash,955,(1)LA13+(1)WBH34,Nourhan Fathi,"10,218 street degla maadi, 0",Maadi-Maadi Degla,2.01E+11,NaN,kindex,2/1/2022,DONE,Delivered,NaN,Cairo
3,#26679,New,Cash,1192,(1)ME36+(1)MT116+(1)ME56+(1)MT126+(1)MT146,Kareem Ismail,"41 , ibrahim el refaey street , 8th zone , nas...",Nasr City,2.01E+11,NaN,kindex,2/1/2022,DONE,Delivered,NaN,Cairo
4,#26680,New,Cash,462.5,(1)LE12,Nada Hassan,"7 el farik mohammed ibrahim, 25",Nasr City,2.01E+11,NaN,kindex,2/1/2022,DONE,Delivered,NaN,Cairo

In [41]:

df2 = df.filter(['Order No','Type','Cash or Visa','Total','Billing City','Governorate','Shipping Company','Date','Money collocation','Shipping Updates'
        ], axis=1)
df2["Date"].replace({"16-Jan": "16/1/2022", "13-Jan": "13/1/2022","17-Jan":"17/1/2022","12-Jan":"12/1/2022","23-1-2022":"23/1/2022"}, inplace=True)

df2.head()

,Order No,Type,Cash or Visa,Total,Billing City,Governorate,Shipping Company,Date,Money collocation,Shipping Updates
0,#26666,New,Cash,1071,Heliopolis-Masaken Sheraton,Cairo,kindex,2/1/2022,DONE,Delivered
1,#26670,New,Cash,720,Warraq,Warraq,kindex,2/1/2022,DONE,Delivered
2,#26674,New,Cash,955,Maadi-Maadi Degla,Cairo,kindex,2/1/2022,DONE,Delivered
3,#26679,New,Cash,1192,Nasr City,Cairo,kindex,2/1/2022,DONE,Delivered
4,#26680,New,Cash,462.5,Nasr City,Cairo,kindex,2/1/2022,DONE,Delivered

In [42]:
list(df2['Shipping Company'].value_counts().keys())

['Bosta', 'Ehab', 'Mylerz', 'kareem', 'kindex', 'aramex', 'Islam', 'WHR']

In [43]:
delivered = df2[df2['Shipping Updates']=='Delivered']

In [44]:
Bosta_del = delivered[delivered['Shipping Company']=='Bosta']
Bosta_orders = df2[df2['Shipping Company']=='Bosta']
x = len(Bosta_del)/len(Bosta_orders)
d = len(Bosta_del)/len(delivered)
ab = df2[df2['Shipping Company']=='Bosta']
ac= len(ab)
print (' compared sucess rate =', round(d,2))
print (' sucess rate =',round(x,2))
print (' total orders=',ac)

 compared sucess rate = 0.33
 sucess rate = 0.91
 total orders= 431

In [45]:
Ehab_del = delivered[delivered['Shipping Company']=='Ehab']
Ehab_orders = df2[df2['Shipping Company']=='Ehab']
ae = df2[df2['Shipping Company']=='Ehab']
ad= len(ae)
e = len(Ehab_del)/len(delivered)
p = len(Ehab_del)/len(Ehab_orders)
print (' compared sucess rate =', round(e,2))
print (' sucess rate =',round(p,2))
print (' total orders=',ad)

 compared sucess rate = 0.22
 sucess rate = 0.91
 total orders= 290

In [46]:
Mylerz_del = delivered[delivered['Shipping Company']=='Mylerz']
Mylerz_orders = df2[df2['Shipping Company']=='Mylerz']
n = len(Mylerz_del)/len(Mylerz_orders)
f = len(Mylerz_del)/len(delivered)
fn = df2[df2['Shipping Company']=='Mylerz']
nf= len(fn)
print (' compared sucess rate =', round(f,2))
print (' sucess rate =',round(n,2))
print (' total orders=',nf)

 compared sucess rate = 0.19
 sucess rate = 0.89
 total orders= 256

In [47]:
kareem_del = delivered[delivered['Shipping Company']=='kareem']
kareem_orders = df2[df2['Shipping Company']=='kareem']
o = len(kareem_del)/len(kareem_orders)
g = len(kareem_del)/len(delivered)
go = df2[df2['Shipping Company']=='kareem']
og= len(go)
print (' compared sucess rate =', round(g,2))
print (' sucess rate =',round(o,2))
print (' total orders=',og)

 compared sucess rate = 0.16
 sucess rate = 0.88
 total orders= 219

In [48]:
kindex_del = delivered[delivered['Shipping Company']=='kindex']
kindex_orders = df2[df2['Shipping Company']=='kindex']
z = len(kindex_del)/len(kindex_orders)
c = len(kindex_del)/len(delivered)
zc = df2[df2['Shipping Company']=='kindex']
cz= len(zc)
print (' compared sucess rate =', round(c,2))
print (' sucess rate =',round(z,2))
print (' total orders=',cz)

 compared sucess rate = 0.07
 sucess rate = 0.91
 total orders= 91

In [49]:
aramex_del = delivered[delivered['Shipping Company']=='aramex']
aramex_orders = df2[df2['Shipping Company']=='aramex']
h = len(aramex_del)/len(delivered)
q = len(aramex_del)/len(aramex_orders)
hq = df2[df2['Shipping Company']=='aramex']
qh= len(hq)

print (' compared sucess rate =', round(h,2))
print (' sucess rate =',round(q,2))
print (' total orders=',qh)

 compared sucess rate = 0.02
 sucess rate = 0.87
 total orders= 23

In [50]:
WHR_del = delivered[delivered['Shipping Company']=='WHR']
WHR_orders = df2[df2['Shipping Company']=='WHR']
m = len(WHR_del)/len(WHR_orders)
i = len(WHR_del)/len(delivered)
mi = df2[df2['Shipping Company']=='WHR']
im= len(mi)
print (' compared sucess rate =', round(i,2))
print (' sucess rate =',round(m,2))
print (' total orders=',im)

 compared sucess rate = 0.0
 sucess rate = 1.0
 total orders= 2

In [51]:
Islam_del = delivered[delivered['Shipping Company']=='Islam']
Islam_orders = df2[df2['Shipping Company']=='Islam']
j = len(Islam_del)/len(delivered)
l = len(Islam_del)/len(Islam_orders)
lj =df2[df2['Shipping Company']=='Islam']
jl= len(lj)
print (' compared sucess rate =', round(j,2))
print (' sucess rate =',round(l,2))
print (' total orders=',jl)

 compared sucess rate = 0.0
 sucess rate = 1.0
 total orders= 2

In [52]:
data = {'company_name': ['Bosta', 'Ehab', 'Mylerz', 'kareem', 'kindex', 'aramex', 'WHR', 'Islam'],
        'compared_sucess_rate': [0.33,0.22,0.19,0.16,0.19,0.02,1,1],
        'sucess_rate':[0.91,0.91,0.89,0.88,0.91,0.81,0.0,0.0],
        'total_orders':[431,290,256,219,91,23,2,2]
        }

sucess_rates = pd.DataFrame(data)

sucess_rates

datatoexcel = pd.ExcelWriter('sucess_rates.xlsx')
  
# write DataFrame to excel
sucess_rates.to_excel(datatoexcel)
  
# save the excel
datatoexcel.save()

whr and isalm shipping companies will be considered as outliers

In [53]:
de= sucess_rates.head(6)

In [54]:
dd= de[['sucess_rate']].mean()
print('avg',+(round(dd,2)))

avg sucess_rate    0.89
dtype: float64

In [55]:
successful_shipping = sucess_rates[sucess_rates['sucess_rate']>= 0.89]
df9 = successful_shipping
df9
#df9 = pd.DataFrame(data)


#datatoexcel = pd.ExcelWriter('df9.xlsx')
  
# write DataFrame to excel

#df9.to_excel(datatoexcel)
  
# save the excel
#datatoexcel.save()

  company_name  compared_sucess_rate  sucess_rate  total_orders
0        Bosta                  0.33         0.91           431
1         Ehab                  0.22         0.91           290
2       Mylerz                  0.19         0.89           256
4       kindex                  0.19         0.91            91

First Solution : give the biggest amout of your orders to the above 4 companies as thier sucess rates is above avarge

In [56]:
list(df2['Cash or Visa'].value_counts().keys())
credit_payments = df2[df2['Cash or Visa']=='visa']
cash=df2[df2['Cash or Visa']=='Cash']
cc=len(credit_payments)/len(df2)
ch=len(cash)/len(df2)
tvp = len(credit_payments)
tcp= len(cash)
print('credit payments=',round(cc,2),
     'cash payments=',round(ch,2),
     'total_visa_paymnets=',tvp,
     'total_cash_payments=',tcp)

credit payments= 0.14 cash payments= 0.86 total_visa_paymnets= 186 total_cash_payments= 1128

In [57]:
ui=len(df2[(df2['Cash or Visa']=='visa') & (df2['Shipping Updates'] =='Refused & returned')])
iu=len(df2[(df2['Cash or Visa']=='visa') & (df2['Shipping Updates'] =='Cancel')])
ci=len(df2[(df2['Cash or Visa']=='Cash') & (df2['Shipping Updates'] =='Refused & returned')])
ic=len(df2[(df2['Cash or Visa']=='Cash') & (df2['Shipping Updates'] =='Cancel')])
print ('Refused & returned_visa=',ui,'Cancel_visa=',iu,'Refused & returned_cash=',ci,'Cancel_cash=',ic)

Refused & returned_visa= 2 Cancel_visa= 2 Refused & returned_cash= 107 Cancel_cash= 18

In [58]:
credit_payments = df2[df2['Cash or Visa']=='visa']
cash=df2[df2['Cash or Visa']=='Cash']
ref_cash=(df2[(df2['Cash or Visa']=='Cash') & (df2['Shipping Updates'] =='Refused & returned')])
cancel_cash=(df2[(df2['Cash or Visa']=='Cash') & (df2['Shipping Updates'] =='Cancel')])
ref_visa=(df2[(df2['Cash or Visa']=='visa') & (df2['Shipping Updates'] =='Refused & returned')])
cancelled_visa=(df2[(df2['Cash or Visa']=='visa') & (df2['Shipping Updates'] =='Cancel')])
#(round(len(cancelled_visa)/len(credit_payments),2))
(round(len(cancel_cash)/len(cash),2))
(round(len(ref_cash)/len(cash),2))

0.09

In [62]:
Data2={ 'date':['30/1/2022',
 '2/1/2022',
 '9/1/2022',
 '23/1/2022',
 '16/1/2022',
 '5/1/2022',
 '31/1/2022',
 '4/1/2022',
 '3/1/2022',
 '25/1/2022',
 '11/1/2022',
 '13/1/2022',
 '24/1/2022',
 '17/1/2022',
 '10/1/2022',
 '18/1/2022',
 '12/1/2022',
 '26/1/2022',
 '19/1/2022',
 '20/1/2022'],
      'total_orders':[198,184,134,100,96,64,57,51,49,47,39,38,38,37,34,32,31,31,28,26]}
orders_per_day = pd.DataFrame(Data2)

orders_per_day.tail()

         date  total_orders
15  18/1/2022            32
16  12/1/2022            31
17  26/1/2022            31
18  19/1/2022            28
19  20/1/2022            26

In [63]:
above_order_avg = orders_per_day[orders_per_day['total_orders']>= 65]
above_order_avg

        date  total_orders
0  30/1/2022           198
1   2/1/2022           184
2   9/1/2022           134
3  23/1/2022           100
4  16/1/2022            96

In [64]:
df3=df2[df2['Shipping Updates']!='Delivered']
df3.head()

,Order No,Type,Cash or Visa,Total,Billing City,Governorate,Shipping Company,Date,Money collocation,Shipping Updates
6,#26687,New,Cash,311,Nasr City,Cairo,kindex,2/1/2022,NaN,Refused & returned
12,#26052,Exchange,Cash,35,giza,Cairo,Bosta,3/1/2022,NaN,Cancel
17,#26651,New,Cash,4030,Cairo,Cairo,kindex,2/1/2022,NaN,Refused & returned
30,#26621,New,Cash,611,Maadi-Zahraa Al Maadi,Maadi-Zahraa Al Maadi,kindex,2/1/2022,NaN,Cancel
31,#26622,New,Cash,305,Nasr City,Nasr City,kindex,2/1/2022,NaN,Refused & returned

In [65]:
len((df3['Cash or Visa']=='visa'))

129

In [66]:
avg_cancelled=df3['Date'].value_counts()
#round((avg_cancelled.mean()),1)
avg_cancelled

2/1/2022     21
9/1/2022     18
30/1/2022    13
16/1/2022     8
3/1/2022      8
4/1/2022      8
11/1/2022     6
31/1/2022     6
23/1/2022     6
10/1/2022     5
5/1/2022      5
24/1/2022     4
12/1/2022     4
25/1/2022     4
17/1/2022     3
19/1/2022     3
20/1/2022     3
13/1/2022     2
18/1/2022     1
26/1/2022     1
Name: Date, dtype: int64

In [67]:
Data3={ 'date':['2/1/2022',
 '9/1/2022',
 '30/1/2022',
 '16/1/2022',
 '4/1/2022',
 '3/1/2022',
 '23/1/2022',
 '31/1/2022',
 '11/1/2022',
 '5/1/2022',
 '10/1/2022',
 '12/1/2022',
 '25/1/2022',
 '24/1/2022',
 '17/1/2022',
 '20/1/2022',
 '19/1/2022',
 '13/1/2022',
 '26/1/2022',
 '18/1/2022'],
      'faild_orders':[21,18,13,8,8,8,6,6,6,5,5,4,4,4,3,3,3,2,1,1]}
cancelled_per_day = pd.DataFrame(Data3)
cancelled_per_day
file_name = 'sigma_fit_1st.xlsx'
cancelled_per_day.to_excel(file_name)

In [74]:
date_both = cancelled_per_day.join(orders_per_day.set_index('date'),on ='date')

date_both['%_of_faild'] = round(date_both['faild_orders']/date_both['total_orders'],2)
date_both

         date  faild_orders  total_orders  %_of_faild
0    2/1/2022            21           184        0.11
1    9/1/2022            18           134        0.13
2   30/1/2022            13           198        0.07
3   16/1/2022             8            96        0.08
4    4/1/2022             8            51        0.16
5    3/1/2022             8            49        0.16
6   23/1/2022             6           100        0.06
7   31/1/2022             6            57        0.11
8   11/1/2022             6            39        0.15
9    5/1/2022             5            64        0.08
10  10/1/2022             5            34        0.15
11  12/1/2022             4            31        0.13
12  25/1/2022             4            47        0.09
13  24/1/2022             4            38        0.11
14  17/1/2022             3            37        0.08
15  20/1/2022             3            26        0.12
16  19/1/2022             3            28        0.11
17  13/1/2022             2            38        0.05
18  26/1/2022             1            31        0.03
19  18/1/2022             1            32        0.03

In [69]:
date_both['faild_orders'].mean()

6.45

sunday: highest cancellation rate 

first week in the year 2,3,4/1

In [70]:
sigma_data_after_cleaning = df2

In [71]:
datatoexcel = pd.ExcelWriter('sigma_data_after_cleaning.xlsx')
  
# write DataFrame to excel
sigma_data_after_cleaning.to_excel(datatoexcel)
  
# save the excel
datatoexcel.save()

In [72]:
dummys=pd.read_excel(r'C:\Users\FADIA\Downloads\Dummy Data (5).xlsx')
dummys.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,Reason,(All),NaN,NaN,NaN,NaN,NaN
1,Order No,(All),NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Sum of Total,Shipping Updates,NaN,NaN,NaN,NaN,NaN
4,Type,Cancel,Delivered,Refused & returned,pending,(blank),Grand Total

In [73]:
bosta_delivered=delivered[delivered['Shipping Company']=='Bosta']
Ehab_delivered=delivered[delivered['Shipping Company']=='Ehab']
Mylerz_delivered=delivered[delivered['Shipping Company']=='Mylerz']
kareem_delivered=delivered[delivered['Shipping Company']=='kareem']
kindex_delivered=delivered[delivered['Shipping Company']=='kindex']
aramex_delivered=delivered[delivered['Shipping Company']=='aramex']
Islam_delivered=delivered[delivered['Shipping Company']=='Islam']
WHR_delivered=delivered[delivered['Shipping Company']=='WHR']



len(WHR_delivered)

2